#### Terraform Plan 📋 `dev/kubernetes`

**Summary:** 17:11:50.357 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
17:11:50.355 STDOUT terraform:   # digitalocean_kubernetes_cluster.k8s will be created
17:11:50.355 STDOUT terraform:   + resource "digitalocean_kubernetes_cluster" "k8s" {
17:11:50.355 STDOUT terraform:       + auto_upgrade                     = true
17:11:50.355 STDOUT terraform:       + cluster_subnet                   = (known after apply)
17:11:50.355 STDOUT terraform:       + created_at                       = (known after apply)
17:11:50.355 STDOUT terraform:       + destroy_all_associated_resources = false
17:11:50.355 STDOUT terraform:       + endpoint                         = (known after apply)
17:11:50.356 STDOUT terraform:       + ha                               = false
17:11:50.356 STDOUT terraform:       + id                               = (known after apply)
17:11:50.356 STDOUT terraform:       + ipv4_address                     = (known after apply)
17:11:50.356 STDOUT terraform:       + kube_config                      = (sensitive value)
17:11:50.356 STDOUT terraform:       + name                             = "dev-cluster"
17:11:50.356 STDOUT terraform:       + region                           = "fra1"
17:11:50.356 STDOUT terraform:       + registry_integration             = false
17:11:50.356 STDOUT terraform:       + service_subnet                   = (known after apply)
17:11:50.356 STDOUT terraform:       + status                           = (known after apply)
17:11:50.356 STDOUT terraform:       + surge_upgrade                    = true
17:11:50.356 STDOUT terraform:       + updated_at                       = (known after apply)
17:11:50.356 STDOUT terraform:       + urn                              = (known after apply)
17:11:50.356 STDOUT terraform:       + version                          = "1.32.10-do.2"
17:11:50.356 STDOUT terraform:       + vpc_uuid                         = "mock-vpc-id"
17:11:50.356 STDOUT terraform:       + amd_gpu_device_metrics_exporter_plugin (known after apply)
17:11:50.356 STDOUT terraform:       + amd_gpu_device_plugin (known after apply)
17:11:50.356 STDOUT terraform:       + control_plane_firewall (known after apply)
17:11:50.356 STDOUT terraform:       + maintenance_policy {
17:11:50.356 STDOUT terraform:           + day        = "saturday"
17:11:50.356 STDOUT terraform:           + duration   = (known after apply)
17:11:50.356 STDOUT terraform:           + start_time = "03:00"
17:11:50.356 STDOUT terraform:         }
17:11:50.356 STDOUT terraform:       + node_pool {
17:11:50.356 STDOUT terraform:           + actual_node_count = (known after apply)
17:11:50.356 STDOUT terraform:           + auto_scale        = true
17:11:50.356 STDOUT terraform:           + id                = (known after apply)
17:11:50.356 STDOUT terraform:           + labels            = {
17:11:50.356 STDOUT terraform:               + "owner"    = "DevOps-Team"
17:11:50.356 STDOUT terraform:               + "priority" = "high"
17:11:50.356 STDOUT terraform:               + "service"  = "app"
17:11:50.356 STDOUT terraform:             }
17:11:50.356 STDOUT terraform:           + max_nodes         = 4
17:11:50.356 STDOUT terraform:           + min_nodes         = 2
17:11:50.356 STDOUT terraform:           + name              = "dev-app-pool"
17:11:50.356 STDOUT terraform:           + node_count        = 2
17:11:50.356 STDOUT terraform:           + nodes             = (known after apply)
17:11:50.356 STDOUT terraform:           + size              = "s-2vcpu-2gb"
17:11:50.356 STDOUT terraform:           + tags              = [
17:11:50.356 STDOUT terraform:               + "component:kubernetes",
17:11:50.356 STDOUT terraform:               + "environment:dev",
17:11:50.356 STDOUT terraform:               + "project:my-devops-project",
17:11:50.356 STDOUT terraform:             ]
17:11:50.356 STDOUT terraform:           + taint {
17:11:50.356 STDOUT terraform:               + effect = "NoSchedule"
17:11:50.356 STDOUT terraform:               + key    = "service"
17:11:50.356 STDOUT terraform:               + value  = "app"
17:11:50.356 STDOUT terraform:             }
17:11:50.356 STDOUT terraform:         }
17:11:50.356 STDOUT terraform:       + nvidia_gpu_device_plugin (known after apply)
17:11:50.356 STDOUT terraform:       + rdma_shared_device_plugin (known after apply)
17:11:50.356 STDOUT terraform:       + routing_agent (known after apply)
17:11:50.356 STDOUT terraform:     }
17:11:50.356 STDOUT terraform:   # digitalocean_kubernetes_node_pool.monitoring will be created
17:11:50.357 STDOUT terraform:   + resource "digitalocean_kubernetes_node_pool" "monitoring" {
17:11:50.357 STDOUT terraform:       + actual_node_count = (known after apply)
17:11:50.357 STDOUT terraform:       + auto_scale        = false
17:11:50.357 STDOUT terraform:       + cluster_id        = (known after apply)
17:11:50.357 STDOUT terraform:       + id                = (known after apply)
17:11:50.357 STDOUT terraform:       + labels            = {
17:11:50.357 STDOUT terraform:           + "owner"    = "DevOps-Team"
17:11:50.357 STDOUT terraform:           + "priority" = "low"
17:11:50.357 STDOUT terraform:           + "service"  = "monitoring"
17:11:50.357 STDOUT terraform:         }
17:11:50.357 STDOUT terraform:       + max_nodes         = 2
17:11:50.357 STDOUT terraform:       + min_nodes         = 1
17:11:50.357 STDOUT terraform:       + name              = "dev-monitoring-pool"
17:11:50.357 STDOUT terraform:       + node_count        = 1
17:11:50.357 STDOUT terraform:       + nodes             = (known after apply)
17:11:50.357 STDOUT terraform:       + size              = "s-2vcpu-2gb"
17:11:50.357 STDOUT terraform:       + tags              = [
17:11:50.357 STDOUT terraform:           + "component:kubernetes",
17:11:50.357 STDOUT terraform:           + "environment:dev",
17:11:50.357 STDOUT terraform:           + "project:my-devops-project",
17:11:50.357 STDOUT terraform:         ]
17:11:50.357 STDOUT terraform:       + taint {
17:11:50.357 STDOUT terraform:           + effect = "NoSchedule"
17:11:50.357 STDOUT terraform:           + key    = "service"
17:11:50.357 STDOUT terraform:           + value  = "monitoring"
17:11:50.357 STDOUT terraform:         }
17:11:50.357 STDOUT terraform:     }
17:11:50.357 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
17:11:50.357 STDOUT terraform: Changes to Outputs:
17:11:50.357 STDOUT terraform:   + app_node_pool_id        = (known after apply)
17:11:50.357 STDOUT terraform:   + cluster_ca_certificate  = (sensitive value)
17:11:50.357 STDOUT terraform:   + cluster_id              = (known after apply)
17:11:50.357 STDOUT terraform:   + cluster_token           = (sensitive value)
17:11:50.357 STDOUT terraform:   + endpoint                = (known after apply)
17:11:50.357 STDOUT terraform:   + kubeconfig              = (sensitive value)
17:11:50.357 STDOUT terraform:   + monitoring_node_pool_id = (known after apply)
17:11:50.409 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
17:11:50.409 STDOUT terraform: Saved the plan to: tfplan
17:11:50.409 STDOUT terraform: To perform exactly these actions, run the following command to apply:
17:11:50.409 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*